DataProcessors/ОбменКонтактамиСТелефонией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ОбменКонтактамиСТелефонией</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолныйАдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОбменКонтактамиСТелефонией/Ext/ObjectModule.bsl
Функция ПолучитьТолькоЧисла(Строка) // Экспорт
	Результат = "";	
	ДлинаСтроки = СтрДлина(Строка);	
	СтрокаЦифр = "0123456789";
	Для i = 1 По ДлинаСтроки Цикл	
		Символ = Сред(Строка,i,1);			
		Если Найти(СтрокаЦифр,Символ)>0 Тогда
			Результат = Результат+Символ;
		КонецЕсли;		
	КонецЦикла;		
	Возврат Результат;	
КонецФункции

Функция ОтправитьФайл(ПолныйАдресРесурса,ТекстЗапроса)	  	
	Попытка 
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
		WinHttp.Option(2,"utf-8"); 
		WinHttp.Open("POST",ПолныйАдресРесурса,0); 
		WinHttp.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8"); 
		WinHttp.Send(ТекстЗапроса); 
		ТекстОтвета = WinHttp.ResponseText(); 
	Исключение
		Возврат("ОШИБКА! Неудачная попытка отправки данных на сервер!");
	КонецПопытки;  	
	
	Возврат(ТекстОтвета);
КонецФункции

Функция ВыполнитьОбменКонтактнойИнформацией() Экспорт

	КлючОбработки = ЭтотОбъект.Метаданные().ПолноеИмя();
	ПолныйАдресРесурса =  ХранилищеОбщихНастроек.Загрузить(КлючОбработки, "ПолныйАдресРесурса", , КлючОбработки);
	УзелОбмена =  ХранилищеОбщихНастроек.Загрузить(КлючОбработки, "УзелОбмена", , КлючОбработки);
	Если ПолныйАдресРесурса = "" Тогда
		Возврат("Адрес ресурса пуст, его нужно заполнить и сохранить настройку");
    КонецЕсли;			
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Объект КАК Объект,
		|	КонтактнаяИнформация.Тип КАК Тип
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				КонтрагентыИзменения.Ссылка
		|			ИЗ
		|				Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
		|			ГДЕ
		|				КонтрагентыИзменения.Узел = &Узел)
		|	И КонтактнаяИнформация.Тип В(&ТипыКонтактнойИнформации)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объект,
		|	Тип
		|ИТОГИ ПО
		|	Объект";
		
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
			Запрос.УстановитьПараметр("Узел",УзелОбмена);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"В
			|			(ВЫБРАТЬ
			|				КонтрагентыИзменения.Ссылка
			|			ИЗ
			|				Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
			|			ГДЕ
			|				КонтрагентыИзменения.Узел = &Узел)"," ССЫЛКА Справочник.Контрагенты");
		КонецЕсли;
		МассивКИ = Новый Массив;
		МассивКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		МассивКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);		
		Запрос.УстановитьПараметр("ТипыКонтактнойИнформации",МассивКИ);	
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаОбъект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		КоличествоОбъектов = ВыборкаОбъект.Количество();
		й=0;
		Пока ВыборкаОбъект.Следующий() Цикл
			й=й+1;
			Контрагент = СтрЗаменить(Строка(ВыборкаОбъект.Объект),";","");		
			Результат = ""+Результат+Контрагент+";";
			ВыборкаДетальныеЗаписи = ВыборкаОбъект.Выбрать();	
			СтрокаТелефоны = "";
			СтрокаИмейл = "";
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Телефон = ПолучитьТолькоЧисла(ВыборкаДетальныеЗаписи.Представление);
					СтрокаТелефоны = СтрокаТелефоны+Телефон+";";
				ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					СтрокаИмейл = ВыборкаДетальныеЗаписи.Представление+"";				
				КонецЕсли;
			КонецЦикла;
			Если СтрокаТелефоны = "" Тогда
				СтрокаТелефоны = ";";
			КонецЕсли;	
			Если й<=КоличествоОбъектов Тогда
				Если й=КоличествоОбъектов Тогда
					Результат = Результат+СтрокаТелефоны+СтрокаИмейл;
				Иначе					 
					Результат = Результат+СтрокаТелефоны+СтрокаИмейл+Символы.ПС;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Результат = "" Тогда
			Возврат("Нет данных для отправки. Контактная информация контрагентов пуста.");
		Иначе
			Результат = "data="+Результат;
			Ответ = ОтправитьФайл(ПолныйАдресРесурса,Результат);
		КонецЕсли;
		Возврат(Ответ);	
КонецФункции
